import streamlit as st


r"""
# Что такое Streamlit

## Определение

**Streamlit** – это фреймворк Python с открытым исходным кодом, используемый для развертывания 
моделей машинного обучения в красивых веб-приложениях всего в несколько строк кода.

## Простые команды Streamlit:

   - st.title() – для установки заголовка;
   - st.text() – для записи описания для конкретного графика();
   - st.markdown() – для отображения текста в виде markdown;
   - st.latex() – для отображения математических выражений на панели мониторинга;
   - st.write() – помогает отображать все возможные детали, например, график, фрейм данных, функции, модель и т. д.;
   - st.sidebar() – для отображения данных на боковой панели;
   - st.dataframe() – для отображения фрейма данных;
   - st.map() – для отображения карты в одной строке кода и т. д.

"""
