import streamlit as st

st.title('Streamlit')

st.header('Возможности')
st.write('**Streamlit** позволяет создавать интерактивные веб-приложения для анализа данных с использованием нескольких языков программирования, включая Python, R и JavaScript. Платформа предоставляет удобный интерфейс для настройки и настройки приложений, а также инструменты для анализа и визуализации данных.')
st.write(' ***Использование сценариев:*** Вы можете создать интерактивное веб-приложение с помощью всего лишь нескольких строк кода, и если вы внесете какие-либо изменения в свой код, то увидите автоматические обновления в веб-приложении. Это происходит с API, предоставляемым этим фреймворком.')
st.write('***Взаимодействие:*** добавить виджеты в ваше веб-приложение так же просто, как объявить переменные в Python.')
st.write('***Мгновенное развертывание:*** платформа обмена Streamlit помогает легко развертывать приложения и управлять ими.')

st.header('Плюсы')
st.write('- Простой интерфейс для настройки и настройки приложений;')
st.write('- Поддержка нескольких языков программирования;')
st.write('- Инструменты для анализа и визуализации данных;')
st.write('- Быстрое время загрузки;')
st.write('- Открытый исходный код.')

st.header('Минусы')
st.write('- Ограниченные дизайнерские возможности;')
st.write('- Нет поддержки мобильных устройств;')
st.write('- Ограниченное количество доступных инструментов анализа данных.')